frontend/models/Profile.php

    public function getGenderList()
    {
        $droptions=  Gender::find()->asArray()->all();
---
SELECT * FROM `gender`